testing/axiom-testsuite/src/main/resources/badsoap/soap11/entity-reference.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <ns:echo xmlns:ns="urn:test">
            &entityref;
        </ns:echo>
    </soapenv:Body>
</soapenv:Envelope>